{
  "architectures": [
    "FineRMoeForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "decoder_sparse_step": 1,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "intermediate_size": 8960,
  "max_position_embeddings": 131072,
  "max_window_layers": 28,
  "model_type": "finer_moe",
  "moe_intermediate_size": 280,
  "norm_topk_prob": false,
  "num_attention_heads": 12,
  "num_experts": 128,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 28,
  "num_key_value_heads": 2,
  "output_router_logits": false,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.001,
  "shared_expert_intermediate_size": 8960,
  "sliding_window": 131072,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.1",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936,
  "moe_concat_proj": false,
  "R_I": 1,
  "R_O": 2,
  "G_I": 32,
  "G_O": 2
}
